# Brewfile - All Homebrew packages to install
# Usage: brew bundle --file=Brewfile

# ============================================================================
# Taps
# ============================================================================
tap "homebrew/bundle"

# ============================================================================
# CLI Tools
# ============================================================================

# Core utilities
brew "coreutils"        # GNU core utilities (those that come with macOS are outdated)
brew "findutils"        # GNU find, xargs, etc.
brew "gnu-sed"          # GNU sed
brew "grep"             # GNU grep
brew "moreutils"        # Useful Unix utilities like sponge

# Shell
brew "zsh"              # Modern shell
# brew "starship"       # Cross-shell prompt (alternative to oh-my-zsh themes)

# Git & Version Control
brew "git"              # Version control
brew "git-delta"        # Better git diffs
brew "gh"               # GitHub CLI
brew "lazygit"          # Terminal UI for git

# File management
brew "tree"             # Directory listing
brew "fd"               # Fast find alternative
brew "ripgrep"          # Fast grep alternative
brew "bat"              # Cat with syntax highlighting
brew "eza"              # Modern ls replacement
brew "fzf"              # Fuzzy finder
brew "jq"               # JSON processor
brew "yq"               # YAML processor

# Networking
brew "curl"             # HTTP client
brew "wget"             # HTTP client
brew "httpie"           # User-friendly HTTP client

# Node.js
brew "fnm"              # Fast Node version manager (Rust-based)
brew "pnpm"             # Fast, disk-efficient package manager

# Python
brew "uv"               # Fast Python package manager (replaces pip, venv, pyenv)

# Other languages (uncomment as needed)
# brew "go"
# brew "rustup"

# Docker & Containers
brew "docker-compose"   # Docker compose (if using Docker Desktop)

# ============================================================================
# Cask Applications
# ============================================================================

# Terminals
cask "alacritty"        # GPU-accelerated terminal
# cask "iterm2"         # Alternative terminal
# cask "warp"           # Modern terminal with AI

# Browsers
cask "google-chrome"    # For development/testing

# Editors & IDEs
cask "zed"                # Fast, modern editor
cask "cursor"             # AI-powered editor
# cask "visual-studio-code"
# cask "jetbrains-toolbox"

# Development Tools
cask "docker"           # Docker Desktop
cask "postman"          # API testing
# cask "insomnia"       # Alternative API client
# cask "tableplus"      # Database GUI

# Productivity
# cask "raycast"          # Spotlight replacement
# cask "rectangle"        # Window management
# cask "1password"        # Password manager
cask "obsidian"         # Notes & docs
cask "linear-linear"    # Issue tracking

# Communication
cask "slack"            # Team chat
cask "zoom"             # Video calls
# cask "discord"

# Utilities
cask "the-unarchiver"   # Archive extraction
cask "appcleaner"       # App uninstaller
# cask "cleanmymac"     # System cleanup
# cask "bartender"      # Menu bar management

# Media
# cask "spotify"
# cask "vlc"

# ============================================================================
# Fonts (Nerd Fonts for terminal)
# ============================================================================

cask "font-ubuntu-mono-nerd-font"    # Your Alacritty font
cask "font-jetbrains-mono-nerd-font" # Alternative
cask "font-fira-code-nerd-font"      # Alternative
cask "font-hack-nerd-font"           # Alternative

# ============================================================================
# Mac App Store (requires `mas` CLI)
# ============================================================================
# brew "mas"  # Uncomment to install mas first
# mas "Xcode", id: 497799835
# mas "Magnet", id: 441258766
# mas "Amphetamine", id: 937984704

